cases/subsonic/Lambert/J20_kernelStudy/b_Dinj/setup/constant/chemistryProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}

chemistryType
{
    solver  ode;
}

chemistry   off;

// ************************************************************************* //
