cases/subsonic/Lambert/J20_kernelStudy/b_Dinj/setup/constant/combustionProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      combustionProperties;
}

combustionModel none;
active          no;

// ************************************************************************* //
