cases/subsonic/Lambert/J20_kernelStudy/b_Dinj/setup/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
// FASE 2 — sprayFoam (transient, spray JetA1 in crossflow aria N2+O2)
//
// Surrogato Jet-A1: C10H22 (n-decano), phaseChangeModel none (no evaporazione).
// Gas: aria secca = N2 (0.767) + O2 (0.233).
// Nessuna reazione (chemistry off, combustionModel none).
// CHEMKIN letto solo per definire le proprieta' termofisiche delle specie gassose.
//

thermoType
{
    type            hePsiThermo;
    mixture         reactingMixture;
    transport       sutherland;
    thermo          janaf;
    energy          sensibleEnthalpy;
    equationOfState perfectGas;
    specie          specie;
}

CHEMKINFile             "<case>/chemkin/chem.inp";
CHEMKINThermoFile       "<case>/chemkin/therm.dat";
CHEMKINTransportFile    "<case>/chemkin/transportProperties";

newFormat       yes;

inertSpecie     N2;

liquids
{
    C10H22;
}

solids {}

// ************************************************************************* //
