cases/subsonic/Lambert/J20_kernelStudy/b_Dinj/setup/system/fvOptions
FoamFile 
{ 
    version 2.0;
    format ascii; 
    class dictionary; 
    location "system"; 
    object fvOptions; 
}

